Tekla Open API Reference for Tekla Structures 2025
Events.ModelSave Event
 The ModelSave event is raised just after a model has been saved.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.ModelSaveDelegate ModelSave
Public Event ModelSave As Events.ModelSaveDelegate
Value
Type: Tekla.Structures.Model.Events.ModelSaveDelegate
Implements
IEvents.ModelSave
See Also
Reference
Events Class
Tekla.Structures.Model Namespace